In [3]:
import pandas as pd

df = pd.read_csv("hw3_data.csv")
df.tail(2)

     Name  Age Department  Salary
6   Grace   35         IT   61000
7  Hannah   30  Marketing   47000

In [4]:
# câu hỏi 1: có bao nhiêu người trên 30 tuổi trong dữ liệu
ds_tren_30 = df.loc[df["Age"]>30, :]
len(ds_tren_30)

3

In [7]:
# Câu hỏi 2: Tổng số tiền lương của tất cả các người có trong dữ liệu là bao nhiêu? 
# tong_luong = df["Salary"].sum()
tong_luong = df.iloc[:, 3:].sum()
tong_luong

Salary    430000
dtype: int64

In [11]:
# Câu hỏi 3: Có bao nhiêu người có lương lớn hơn 50,000 và tuổi nhỏ hơn 40?
df_luong50 = df.loc[df["Salary"] > 50000, :]
df_tuoi40 = df_luong50.loc[df["Age"] < 40, :]
df_luong50_tuoi40 = df.loc[(df["Salary"] > 50000) & (df["Age"] < 40), :]
df_luong50_tuoi40

      Name  Age Department  Salary
1      Bob   27         IT   52000
2  Charlie   22    Finance   55000
3    David   32         IT   60000
6    Grace   35         IT   61000

## DẤU bitwise:
- & (and)
- | (or)
- ~ (not)